{"day":"2018-05-19","events":[{"id":21580,"title":"OpenStack Upstream Institute Sponsored by Lenovo - Day 1 (RSVP Required)","class_name":"Presentation","abstract":"<p>OpenStack Upstream Institute is an intensive program designed to share knowledge about the different ways of contributing to OpenStack like providing new features, writing documentation, participating in working groups, and so forth. The educational program is built on the principle of open collaboration and will teach the students how to find information and navigate the intricacies of the project’s technical tools and social interactions in order to get the contributions accepted. The live one and a half day class is focusing on hands-on practice like the students can use a development environment to work on real-life bug fixes or new features and learn how to test, prepare and upload them for review. The attendees are also given the opportunity to join a mentoring program to get further help and guidance on their journey to become an active and successful member of the OpenStack community.<\/p>\n<p> <\/p>","start_epoch":1526738400,"end_epoch":1526752800,"start_datetime":"2018-05-19 14:00:00","end_datetime":"2018-05-19 18:00:00","start_time":"2:00pm","end_time":"6:00pm","date_nice":"Sat 19","allow_feedback":"1","location_id":356,"type_id":158,"rsvp_link":"https:\/\/www.openstack.org\/summit\/vancouver-2018\/summit-schedule\/events\/21580\/openstack-upstream-institute-sponsored-by-lenovo-day-1-rsvp-required\/rsvp","has_rsvp":true,"rsvp_external":false,"rsvp_seat_type":"Regular","sponsors_id":[720],"category_group_ids":[],"tags_id":[],"going":false,"favorite":false,"show":true,"headcount":0,"summit_id":24,"time_zone_id":"America\/Vancouver","attendees_schedule_count":40,"track_id":222,"attachment_url":"","to_record":false,"url":"https:\/\/www.openstack.org\/summit\/vancouver-2018\/summit-schedule\/events\/21580\/openstack-upstream-institute-sponsored-by-lenovo-day-1-rsvp-required","social_summary":"OpenStack Upstream Institute"}]}
